; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_3 object type_1 type_2)
 (:predicates (pred_2 ?v8 - type_1 ?v2 - type_3)
 	      (pred_3 ?v7 - object ?v2 - type_3)
	      (pred_1 ?v8 - type_1 ?v5 - type_2)
	      (pred_4 ?v8 - type_1 ?v7 - object ?v5 - type_2))

   (:action op_1
       :parameters  (?v8 - type_1 ?v1 ?v3 - type_3)
       :precondition (and  (pred_2 ?v8 ?v1))
       :effect (and  (pred_2 ?v8 ?v3)
		     (not (pred_2 ?v8 ?v1))))

   (:action op_2
       :parameters (?v8 - type_1 ?v6 - object ?v4 - type_3 ?v5 - type_2)
       :precondition  (and  (pred_3 ?v6 ?v4) (pred_2 ?v8 ?v4) (pred_1 ?v8 ?v5))
       :effect (and (pred_4 ?v8 ?v6 ?v5)
		    (not (pred_3 ?v6 ?v4)) 
		    (not (pred_1 ?v8 ?v5))))

   (:action op_3
       :parameters (?v8 - type_1 ?v6 - object ?v4 - type_3 ?v5 - type_2)
       :precondition  (and  (pred_4 ?v8 ?v6 ?v5) (pred_2 ?v8 ?v4))
       :effect (and (pred_3 ?v6 ?v4)
		    (pred_1 ?v8 ?v5)
		    (not (pred_4 ?v8 ?v6 ?v5)))))

; problem
(define (problem gripper-2-3-3)
(:domain gripper-strips)
(:objects obj_06 obj_03 - type_1
obj_08 obj_11 obj_01 obj_02 - type_2
obj_10 obj_05 obj_04 - type_3
obj_09 obj_12 obj_07 - object)
(:init
(pred_2 obj_06 obj_04)
(pred_1 obj_06 obj_08)
(pred_1 obj_06 obj_11)
(pred_2 obj_03 obj_10)
(pred_1 obj_03 obj_01)
(pred_1 obj_03 obj_02)
(pred_3 obj_09 obj_04)
(pred_3 obj_12 obj_10)
(pred_3 obj_07 obj_05)
)
(:goal
(and
(pred_3 obj_09 obj_10)
(pred_3 obj_12 obj_04)
(pred_3 obj_07 obj_05)
)
)

(:constraints
  (and
    (always (not (and (pred_2 obj_06 obj_04) (pred_2 obj_03 obj_04))))
  )
)
)

; plan
1. (op_2 obj_03 obj_12 obj_10 obj_02)
   deleted: (pred_3 obj_12 obj_10) (pred_1 obj_03 obj_02)
   added: (pred_4 obj_03 obj_12 obj_02)
   goals met: 1 of 3
2. (op_2 obj_06 obj_09 obj_04 obj_11)
   deleted: (pred_3 obj_09 obj_04) (pred_1 obj_06 obj_11)
   added: (pred_4 obj_06 obj_09 obj_11)
   goals met: 1 of 3
3. (op_1 obj_06 obj_04 obj_10)
   deleted: (pred_2 obj_06 obj_04)
   added: (pred_2 obj_06 obj_10)
   goals met: 1 of 3
4. (op_1 obj_03 obj_10 obj_04)
   deleted: (pred_2 obj_03 obj_10)
   added: (pred_2 obj_03 obj_04)
   goals met: 1 of 3
5. (op_3 obj_03 obj_12 obj_04 obj_02)
   deleted: (pred_4 obj_03 obj_12 obj_02)
   added: (pred_3 obj_12 obj_04) (pred_1 obj_03 obj_02)
   goals met: 2 of 3
6. (op_3 obj_06 obj_09 obj_10 obj_11)
   deleted: (pred_4 obj_06 obj_09 obj_11)
   added: (pred_3 obj_09 obj_10) (pred_1 obj_06 obj_11)
   goals met: 3 of 3
